In [1]:
# !conda install -c conda-forge ipython-sql
%load_ext sql
%sql postgresql://postgres:none@172.28.21.7/postgres

'Connected: postgres@postgres'

[* Вставить значение python-переменной в запрос ipython-sql](https://github.com/catherinedevlin/ipython-sql#variable-substitution)

In [2]:
%sql select * from orders limit 3;

 * postgresql://postgres:***@172.28.21.7/postgres
3 rows affected.

[(1, 'CA-2018-152156', datetime.date(2018, 11, 8), datetime.date(2018, 11, 11), 'Second Class', 'CG-12520', 'Claire Gute', 'Consumer', 'United States', 'Henderson', 'Kentucky', 42420, 'South', 'FUR-BO-10001798', 'Furniture', 'Bookcases', 'Bush Somerset Collection Bookcase', Decimal('261.9600'), 2, Decimal('0.00'), Decimal('41.9136000000000000')),
 (2, 'CA-2018-152156', datetime.date(2018, 11, 8), datetime.date(2018, 11, 11), 'Second Class', 'CG-12520', 'Claire Gute', 'Consumer', 'United States', 'Henderson', 'Kentucky', 42420, 'South', 'FUR-CH-10000454', 'Furniture', 'Chairs', 'Hon Deluxe Fabric Upholstered Stacking Chairs, Rounded Back', Decimal('731.9400'), 3, Decimal('0.00'), Decimal('219.5820000000000000')),
 (3, 'CA-2018-138688', datetime.date(2018, 6, 12), datetime.date(2018, 6, 16), 'Second Class', 'DV-13045', 'Darrin Van Huff', 'Corporate', 'United States', 'Los Angeles', 'California', 90036, 'West', 'OFF-LA-10000240', 'Office Supplies', 'Labels', 'Self-Adhesive Address Labels for Typewriters by Universal', Decimal('14.6200'), 2, Decimal('0.00'), Decimal('6.8714000000000000'))]

In [3]:
%sql SELECT tablename FROM pg_catalog.pg_tables where schemaname='public';

 * postgresql://postgres:***@172.28.21.7/postgres
4 rows affected.

[('supply',), ('people',), ('returns',), ('orders',)]

In [4]:
%%sql
SELECT
    column_name,
    data_type
FROM
    information_schema.columns
WHERE
    table_name = 'orders';

 * postgresql://postgres:***@172.28.21.7/postgres
21 rows affected.

[('row_id', 'integer'),
 ('order_date', 'date'),
 ('ship_date', 'date'),
 ('postal_code', 'integer'),
 ('sales', 'numeric'),
 ('quantity', 'integer'),
 ('discount', 'numeric'),
 ('profit', 'numeric'),
 ('country', 'character varying'),
 ('city', 'character varying'),
 ('state', 'character varying'),
 ('product_name', 'character varying'),
 ('region', 'character varying'),
 ('product_id', 'character varying'),
 ('order_id', 'character varying'),
 ('category', 'character varying'),
 ('subcategory', 'character varying'),
 ('ship_mode', 'character varying'),
 ('customer_id', 'character varying'),
 ('customer_name', 'character varying'),
 ('segment', 'character varying')]

In [5]:
%%sql
--Overview (обзор ключевых метрик)
--Total Sales
--Total Profit
select sum(sales), sum(profit) from orders;

 * postgresql://postgres:***@172.28.21.7/postgres
1 rows affected.

[(Decimal('2297200.8603'), Decimal('286397.0216999999887055'))]

In [6]:
%%sql
--Profit Ratio
with profit_stats as (
    select 
        (select count(*) cnt from orders where Profit >= 0) as Profitable        
        ,(select count(*) cnt from orders where Profit < 0) as Improfitable
)
select 
    Profitable, Improfitable, ROUND(1.0*Profitable/Improfitable, 2) as "Profit Ratio"
    from profit_stats;

 * postgresql://postgres:***@172.28.21.7/postgres
1 rows affected.

[(8123, 1871, Decimal('4.34'))]

In [7]:
%%sql
--Profit per Order
select order_id, sum(profit), count(profit) as items
from orders
group by order_id 
order by 2 desc
limit 10;

 * postgresql://postgres:***@172.28.21.7/postgres
10 rows affected.

[('CA-2018-118689', Decimal('8762.3891000000000000'), 5),
 ('CA-2019-140151', Decimal('6734.4720000000000000'), 3),
 ('CA-2019-166709', Decimal('5039.9856000000000000'), 1),
 ('CA-2018-117121', Decimal('4946.3700000000000000'), 1),
 ('CA-2016-116904', Decimal('4668.6935000000000000'), 4),
 ('CA-2019-127180', Decimal('4597.1656999999999980'), 4),
 ('CA-2017-145352', Decimal('3192.0682000000000000'), 4),
 ('CA-2018-158841', Decimal('2825.2862000000000000'), 3),
 ('US-2018-140158', Decimal('2640.4798000000000000'), 3),
 ('CA-2019-138289', Decimal('2602.0939000000000000'), 3)]

In [8]:
%%sql
--Sales per Customer
select customer_id, customer_name, sum(sales) "total sales"
from orders
group by 1,2
order by 3 desc
limit 15;

 * postgresql://postgres:***@172.28.21.7/postgres
15 rows affected.

[('SM-20320', 'Sean Miller', Decimal('25043.0500')),
 ('TC-20980', 'Tamara Chand', Decimal('19052.2180')),
 ('RB-19360', 'Raymond Buch', Decimal('15117.3390')),
 ('TA-21385', 'Tom Ashbrook', Decimal('14595.6200')),
 ('AB-10105', 'Adrian Barton', Decimal('14473.5710')),
 ('KL-16645', 'Ken Lonsdale', Decimal('14175.2290')),
 ('SC-20095', 'Sanjit Chand', Decimal('14142.3340')),
 ('HL-15040', 'Hunter Lopez', Decimal('12873.2980')),
 ('SE-20110', 'Sanjit Engle', Decimal('12209.4380')),
 ('CC-12370', 'Christopher Conant', Decimal('12129.0720')),
 ('TS-21370', 'Todd Sumrall', Decimal('11891.7510')),
 ('GT-14710', 'Greg Tran', Decimal('11820.1200')),
 ('BM-11140', 'Becky Martin', Decimal('11789.6300')),
 ('SV-20365', 'Seth Vernon', Decimal('11470.9500')),
 ('CJ-12010', 'Caroline Jumper', Decimal('11164.9740'))]

In [9]:
%%sql
--Avg. Discount
select round(avg(discount), 3) as "average_discount"
from orders;

 * postgresql://postgres:***@172.28.21.7/postgres
1 rows affected.

[(Decimal('0.156'),)]

In [10]:
%%sql
--Monthly Sales by Segment ( табличка и график)
select 
    segment    
    ,date_part('year', order_date) as year
    ,date_part('month', order_date) as month    
    ,sum(sales) as sales
from orders
group by segment, year, month
order by segment, year, month
limit 15;

 * postgresql://postgres:***@172.28.21.7/postgres
15 rows affected.

[('Consumer', 2016.0, 1.0, Decimal('6927.8170')),
 ('Consumer', 2016.0, 2.0, Decimal('3167.8540')),
 ('Consumer', 2016.0, 3.0, Decimal('11869.3040')),
 ('Consumer', 2016.0, 4.0, Decimal('9108.6120')),
 ('Consumer', 2016.0, 5.0, Decimal('12819.1630')),
 ('Consumer', 2016.0, 6.0, Decimal('25923.7476')),
 ('Consumer', 2016.0, 7.0, Decimal('20197.7400')),
 ('Consumer', 2016.0, 8.0, Decimal('16215.2635')),
 ('Consumer', 2016.0, 9.0, Decimal('59690.6500')),
 ('Consumer', 2016.0, 10.0, Decimal('16246.6970')),
 ('Consumer', 2016.0, 11.0, Decimal('46571.9780')),
 ('Consumer', 2016.0, 12.0, Decimal('37357.9865')),
 ('Consumer', 2017.0, 1.0, Decimal('14274.9836')),
 ('Consumer', 2017.0, 2.0, Decimal('9269.0180')),
 ('Consumer', 2017.0, 3.0, Decimal('17418.8900'))]

In [11]:
%%sql
--Yearly Sales by Product Category (табличка и график)
select 
    category "Product Category"
    ,date_part('year', order_date) as "Year"
    ,round(sum(sales),0) as "Total sales"
from orders
group by 1, 2
order by 1, 2;

 * postgresql://postgres:***@172.28.21.7/postgres
12 rows affected.

[('Furniture', 2016.0, Decimal('157193')),
 ('Furniture', 2017.0, Decimal('170518')),
 ('Furniture', 2018.0, Decimal('198901')),
 ('Furniture', 2019.0, Decimal('215387')),
 ('Office Supplies', 2016.0, Decimal('151776')),
 ('Office Supplies', 2017.0, Decimal('137233')),
 ('Office Supplies', 2018.0, Decimal('183940')),
 ('Office Supplies', 2019.0, Decimal('246097')),
 ('Technology', 2016.0, Decimal('175278')),
 ('Technology', 2017.0, Decimal('162781')),
 ('Technology', 2018.0, Decimal('226364')),
 ('Technology', 2019.0, Decimal('271731'))]

In [12]:
%%sql
--Sales and Profit by Customer
select customer_name "Customer", round(sum(sales), 2) "Total Sales"
from orders
group by 1
order by 2 desc
limit 15;

 * postgresql://postgres:***@172.28.21.7/postgres
15 rows affected.

[('Sean Miller', Decimal('25043.05')),
 ('Tamara Chand', Decimal('19052.22')),
 ('Raymond Buch', Decimal('15117.34')),
 ('Tom Ashbrook', Decimal('14595.62')),
 ('Adrian Barton', Decimal('14473.57')),
 ('Ken Lonsdale', Decimal('14175.23')),
 ('Sanjit Chand', Decimal('14142.33')),
 ('Hunter Lopez', Decimal('12873.30')),
 ('Sanjit Engle', Decimal('12209.44')),
 ('Christopher Conant', Decimal('12129.07')),
 ('Todd Sumrall', Decimal('11891.75')),
 ('Greg Tran', Decimal('11820.12')),
 ('Becky Martin', Decimal('11789.63')),
 ('Seth Vernon', Decimal('11470.95')),
 ('Caroline Jumper', Decimal('11164.97'))]

In [13]:
%%sql
--Customer Ranking
-- из табличек сумм продаж и выручки с агрегацией по клиенту
-- получаем ранки и объединяем две ранковых таблицы по имени клиента 
with sales_sum as (
    select customer_name, round(sum(sales), 2) total_sales
    from orders
    group by customer_name
), profit_sum as (
    select customer_name, round(sum(profit), 2) total_profit
    from orders
    group by customer_name
)
select
    customer_name "Customer Name"
    ,sales_ranking.rnk "Rank by Total Sales"
    ,sales_ranking.total_sales "Total Sales"
    ,profit_ranking.rnk "Rank by Total Profit"
    ,profit_ranking.total_profit "Total Profit"
from 
    (select 
        customer_name
        ,rank() over(order by total_sales DESC) rnk
        ,total_sales
    from sales_sum) sales_ranking
    join
    (select 
        customer_name
        ,rank() over(order by total_profit DESC) rnk
        ,total_profit
    from profit_sum) profit_ranking
    using (customer_name)
order by "Rank by Total Profit"
limit 15;

 * postgresql://postgres:***@172.28.21.7/postgres
15 rows affected.

[('Tamara Chand', 2, Decimal('19052.22'), 1, Decimal('8981.32')),
 ('Raymond Buch', 3, Decimal('15117.34'), 2, Decimal('6976.10')),
 ('Sanjit Chand', 7, Decimal('14142.33'), 3, Decimal('5757.41')),
 ('Hunter Lopez', 8, Decimal('12873.30'), 4, Decimal('5622.43')),
 ('Adrian Barton', 5, Decimal('14473.57'), 5, Decimal('5444.81')),
 ('Tom Ashbrook', 4, Decimal('14595.62'), 6, Decimal('4703.79')),
 ('Christopher Martinez', 26, Decimal('8954.02'), 7, Decimal('3899.89')),
 ('Keith Dawkins', 36, Decimal('8181.26'), 8, Decimal('3038.63')),
 ('Andy Reiter', 61, Decimal('6608.45'), 9, Decimal('2884.62')),
 ('Daniel Raglin', 31, Decimal('8350.87'), 10, Decimal('2869.08')),
 ('Tom Boeckenhauer', 24, Decimal('9133.99'), 11, Decimal('2798.37')),
 ('Nathan Mautz', 65, Decimal('6459.34'), 12, Decimal('2751.68')),
 ('Sanjit Engle', 9, Decimal('12209.44'), 13, Decimal('2650.68')),
 ('Bill Shonely', 19, Decimal('10501.65'), 14, Decimal('2616.06')),
 ('Harry Marie', 35, Decimal('8236.76'), 15, Decimal('2437.98'))]

In [14]:
%%sql
--Sales per region
-- добавлю отдельную строку итогов
with separate_values as 
(
    select region "Region"
        ,sum(sales) "Total Sales"
        ,sum(sales)/(select sum(sales) from orders) * 100 "Percentage"
    from orders
    group by 1
)
select "Region"
    ,round("Total Sales", 2) "Total Sales"
    ,round("Percentage", 1) "Percentage"
from separate_values
union
select 'All'
    ,round(sum("Total Sales"), 2)
    ,round(sum("Percentage"), 1)
from separate_values;

 * postgresql://postgres:***@172.28.21.7/postgres
5 rows affected.

[('All', Decimal('2297200.86'), Decimal('100.0')),
 ('Central', Decimal('501239.89'), Decimal('21.8')),
 ('South', Decimal('391721.91'), Decimal('17.1')),
 ('East', Decimal('678781.24'), Decimal('29.5')),
 ('West', Decimal('725457.82'), Decimal('31.6'))]